programming/php/php_library.org
#+setupfile: ../../styles/readtheorg.setup
#+title: PHP Library

* 分类

| *ORM*  | Doctrine |
|        | Eloquent |
|        | Propel   |
|--------+----------|
| *日志* | Monolog  |

* cURL

[[http://php.net/manual/en/book.curl.php][php.net]]

#+caption: 传输前
| =curl_init()=   | 初始化 cURL 会话               |
|-----------------+--------------------------------|
| =curl_setopt()= | 为 cURL 传输设置选项（option） |

#+caption: 传输
| =curl_exec()= |   |

#+caption: 传输后
| =curl_errno()=   | 返回最后一次 cURL 操作的错误状态码 |
|------------------+------------------------------------|
| =curl_error()=   | 返回最后一次 cURL 操作的错误信息   |
|------------------+------------------------------------|
| =curl_getinfo()= | 返回最后一次传输的相关信息         |
|------------------+------------------------------------|
| =curl_close()=   |                                    |

** =curl_init()=

#+begin_src php
resource curl_init ([ string $url = null ])
#+end_src

** =curl_setopt()=

#+begin_src php
bool curl_setopt (
    resource $ch
,   int      $option
,   mixed    $value
)
#+end_src

#+caption: =$option=
|                             | 类型   | 含义                                                          | 示例                                 |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLINFO_HEADER_OUT=       | bool   | 是否追踪句柄的请求字符串                                      |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_CONNECTTIMEOUT=    | int    | 发起连接前等待的时间，7.16.2 之后使用毫秒数                   |                                      |
| =CURLOPT_CONNECTTIMEOUT_MS= |        |                                                               |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_COOKIE=            | string |                                                               | =<name>=<value>; ...=                |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_CUSTOMREQUEST=     | string | 自定义的请求类型                                              | =GET= =POST= =CONNECT=               |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_ENCODING=          | string | HTTP header 中 =Accept-Encoding= 的值                         | =identity= =deflate= =gzip=          |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_HEADER=            | bool   | 是否将 header 内容作为数据流输出                              |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_HTTPHEADER=        | array  |                                                               | =array('<header>', '<header>', ...)= |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_HTTP_VERSION=      | int    | =CURL_HTTP_VERSION_NONE= ：自行判断版本（默认值）             |                                      |
|                             |        | =CURL_HTTP_VERSION_1_0= ：强制 HTTP/1.0                       |                                      |
|                             |        | =CURL_HTTP_VERSION_1_1= ：强制 HTTP/1.1                       |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_NOBODY=            | bool   | 是否对 HTML 中的 =<body>= 部分进行输出                        |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_NOSIGNAL=          | bool   | 是否忽略 cURL 传递给 PHP 的信号                               |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_POSTFIELDS=        | string | 字符串为 =urlencoded()= 后的字符串                            | =<name>=<value>&...=                 |
|                             | array  | 发送文件时，值为 =@<full_path>=                               | =array(<name> => <value>, ... )=     |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_PROXY=             | string | 代理服务器地址                                                |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_PROXYPORT=         | int    | 代理服务器端口                                                |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_PROXYTYPE=         | int    | =CURLPROXY_HTTP= （默认值）                                   |                                      |
|                             |        | =CURLPROXY_SOCKS5=                                            |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_RANGE=             | string | 获取数据的字节范围                                            | =<from>-<to>=                        |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_RETURNTRANSFER=    | bool   | 是否将 =curl_exec()= 的结果以文件流的形式返回，而不是直接输出 |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_SSL_VERIFYPEER=    | bool   | 是否从服务端进行验证                                          |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_TIMEOUT=           | int    | 允许执行的最长秒数，7.16.2 之后使用毫秒数                     |                                      |
| =CURLOPT_TIMEOUT_MS=        |        |                                                               |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_URL=               | string | 需要获取的 URL 地址                                           |                                      |
|-----------------------------+--------+---------------------------------------------------------------+--------------------------------------|
| =CURLOPT_USERPWD=           | string | 用户名和密码                                                  | =<user>:<password>=                  |

** =curl_exec()=

#+begin_src php
mixed curl_exec ( resource $ch )
#+end_src

|        |         |                                                                                 |
|--------+---------+---------------------------------------------------------------------------------|
| 返回值 | boolean | 成功时返回 =true= ，否则返回 =false=                                            |
|        | mixed   | =CURLOPT_RETURNTRANSFER= 设置为 =true= 时，成功时返回执行结果，否则返回 =false= |

** =curl_errno()=

#+begin_src php
int curl_errno ( resource $ch )
#+end_src

| 返回值 | int | =0= 为没有发生错误 |

** =curl_error()=

#+begin_src php
string curl_error ( resource $ch )
#+end_src

| 返回值 | string | 空字符串为没有发生错误  |

** =curl_getinfo()=

#+begin_src php
mixed curl_getinfo (
    resource $ch
[,  int      $opt = 0
])
#+end_src

* PHPMailer

[[https://github.com/PHPMailer/PHPMailer][GitHub]]

* PHPExcel

[[https://github.com/PHPOffice/PHPExcel][GitHub]]
* TCPDF

[[http://www.tcpdf.org/][TCPDF]]
